# Задача 32: Определить элементs массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 1
# 19
# Вывод: [1, 9, 13, 14, 19]

print ('Введите массив: ')
list1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
print(list)
min_number = int(input('Введите min число: '))
max_number = int(input('Введите max число: '))
for i in list1:
    if min_number <= i <= max_number:
        print(i, end = ' ')